story_api/app/controllers/stories_controller.rb

INSERT INTO "stories" ("name", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Bill"], ["body", "Things are...not great"], ["created_at", "2020-04-03 20:04:19.098977"], ["updated_at", "2020-04-03 20:04:19.098977"]]
---
  def create
    @story = Story.new(story_params)

    if @story.save

UPDATE "stories" SET "body" = $1, "updated_at" = $2 WHERE "stories"."id" = $3  [["body", "Things are...pretty great"], ["updated_at", "2020-04-03 20:05:06.001521"], ["id", 8]]
---
  def update
    if @story.update(story_params)